<template>
	<UContainer class="min-[900px]:mt-8 max-[900px]:mt-4">
		<div class="min-[900px]:grid grid-cols-3 gap-8">
			<div class="max-[900px]:flex max-[900px]:mb-4">	
				<div class="bg-white p-4 rounded-4xl max-[900px]:w-full">
					<div class="relative pb-[100%]">
						<img class="absolute w-full object-cover rounded-2xl" src="/avatar.jpeg" alt="Моя фотография"/>
					</div>
				</div>
			</div>

      <div class="col-start-2 col-end-4 bg-white p-4 rounded-4xl">
				<h1 class="text-4xl mb-4">Обо мне</h1>
				<p class="mb-2">
					Здравствуйте. Признаюсь, мне всегда было тесно в рамках одного жанра или одного занятия. Как писал мой любимый поэт, «не могу я жить, чтоб не писать и не мыслить». Моя стихия — это творчество во всех его проявлениях, будь то создание текстов, проектов или стратегий.
				</p>

				<p class="mb-2">
					Мой путь начался в атмосфере, где ценили слово и образ мыслей. Я получил блестящее образование, которое стало не просто сводом знаний, а ключом к пониманию мира и людей. Склонность к язвительному наблюдению и независимости суждений не раз приводила меня к творческим конфликтам, но именно они закалили характер и отточили мысль.
				</p>

				<p class="mb-2">
					Главный источник моей силы и вдохновения — это люди. Их страсти, истории, смех и печали. Я верю, что подлинная глубина кроется в простоте, а подлинная простота — в глубине. Мои принципы: служение идее (как бы высокопарно это ни звучало), верность выбранному делу и бесконечное любопытство к жизни во всех её красках.
				</p>

				<p class="mb-2">
					Как и положено человеку с романтической душой, я ценю дружбу, остроумную беседу за кружкой чего-нибудь горячительного и стремление к свободе. Порой я бываю неудобен, потому что предпочитаю честность лести.
				</p>

				<p class="mb-2">
					Сегодня я здесь, чтобы творить, соединять идеи и находить неожиданные решения. Приглашаю и вас к этому диалогу.
				</p>

				<p>
					Ваш покорный слуга,
				</p>
				<p>
					Резванов Сергей Владимирович
				</p>
			</div>
		</div>

		<div class="min-[900px]:mt-8 max-[900px]:mt-4 bg-white p-4 rounded-4xl">
			<h2 class="text-4xl mb-4">
				Мои публикации
			</h2>
			<AboutMePublicationList />
		</div>
	</UContainer>
</template>
